"""
Формат ввода
В первой строчке задано число N — число фанатов,

во второй число М — количество знакомств между
фанатами.

Далее следует M пар чисел от 0 до N-1,
разделенных пробелом: каждая пара означает обоюдное
знакомство между фанатами.

Далее следует число K —
количество типов машин, и K пар вида (вместимость
машины, количество таких машин). Пары
гарантированно уникальны.

1 <= N <= 1000

0 <= K <= 1000

Формат вывода
На выходе должно быть число 1, если у таксопарка
получится развести фанатов, и 0, если не получится.
"""