"""
Водитель приехал в новый город, который пока ещё
не знает. Он захотел изучить все улицы города.

Чтобы запомнить улицу, ему достаточно посетить
любой перекрёсток, который образует эта улица.
Поэтому водитель решил посетить все перекрёстки
города.

Но в городе начали ремонтировать дороги и перекрыли
часть улиц. На каждом перекрёстке остаётся как
минимум одна улица, по которой можно проехать.
Перекрёстки с одной неперекрытой улицей — тупики,
но водитель твёрдо решил посетить все перекрёстки,
и его ничто не остановит. Также водитель точно знает,
что может добраться до всех перекрёстков в городе с
любого другого перекрёстка.
"""

from pathlib import Path


scriptDir = Path.cwd()


def main():
    pass


if __name__ == '__main__':
    main()

