"""
После футбольного матча фанаты пытаются уехать домой
на такси. Чтобы сэкономить, они объединяются в группы:
фанат присоединяется к группе, если знает хотя бы
одного человека из неё, группа хочет ехать исключительно
в одной машине, а две разные группы отказываются ехать
вместе. Таксопарк владеет ограниченным числом машин
заданной вместимости. Определите, получится ли у
таксопарка развезти экономных фанатов.
"""

from pathlib import Path


scriptDir = Path.cwd()


def main():
    possible = 1

    print(possible)


if __name__ == '__main__':
    main()

