"""
ФОРМАТ ВВОДА
Первая строка содержит одно целое неотрицательное
число шатл-станций N ≤ 1000.

Вторая строка содержит N чисел, задающих стоимости
строительства генератора внутри соответствующей
станции.

Третья строка содержит одно целое неотрицательное
число возможных кабелей K ≤ 100000 между шатл-станциями.

Последующие K строк (начиная с четвёртой) содержат
описание одного кабеля - три целых неотрицательных
числа: номер первой станции, номер второй станции
и стоимость проведения.


ФОРМАТ ВЫВОДА
Одно целое число - минимальная стоимость питания
всех шатл-станций для заднной конфигурации.


ПРИМЕЧАНИЯ
1. Станции нумеруются с единицы.
2. Числа внутри строки разделяются одним пробелом.
3. Корректность входных данных проверять не требуется.
"""